MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F452FEUB/mcu.h
/*  Bit definition for FCM_RIER register  */
#define FCM_RIER_ERRIE_POS                             (0U)
#define FCM_RIER_ERRIE                                 (0x00000001UL)
#define FCM_RIER_MENDIE_POS                            (1U)
#define FCM_RIER_MENDIE                                (0x00000002UL)
#define FCM_RIER_OVFIE_POS                             (2U)
#define FCM_RIER_OVFIE                                 (0x00000004UL)
#define FCM_RIER_ERRINTRS_POS                          (4U)
#define FCM_RIER_ERRINTRS                              (0x00000010UL)
#define FCM_RIER_ERRE_POS                              (7U)
#define FCM_RIER_ERRE                                  (0x00000080UL)

/*  Bit definition for FCM_SR register  */
#define FCM_SR_ERRF_POS                                (0U)
#define FCM_SR_ERRF                                    (0x00000001UL)
#define FCM_SR_MENDF_POS                               (1U)
#define FCM_SR_MENDF                                   (0x00000002UL)
#define FCM_SR_OVF_POS                                 (2U)
#define FCM_SR_OVF                                     (0x00000004UL)

/*  Bit definition for FCM_CLR register  */
#define FCM_CLR_ERRFCLR_POS                            (0U)
#define FCM_CLR_ERRFCLR                                (0x00000001UL)
#define FCM_CLR_MENDFCLR_POS                           (1U)
#define FCM_CLR_MENDFCLR                               (0x00000002UL)
#define FCM_CLR_OVFCLR_POS                             (2U)
#define FCM_CLR_OVFCLR                                 (0x00000004UL)

/*******************************************************************************
                Bit definition for Peripheral GPIO
*******************************************************************************/
/*  Bit definition for GPIO_PIDRA register  */
#define GPIO_PIDRA_PIN00_POS                           (0U)
#define GPIO_PIDRA_PIN00                               (0x0001U)
#define GPIO_PIDRA_PIN04_POS                           (4U)
#define GPIO_PIDRA_PIN04                               (0x0010U)
#define GPIO_PIDRA_PIN08_POS                           (8U)
#define GPIO_PIDRA_PIN08                               (0x0100U)
#define GPIO_PIDRA_PIN11_POS                           (11U)
#define GPIO_PIDRA_PIN11                               (0x0800U)
#define GPIO_PIDRA_PIN12_POS                           (12U)
#define GPIO_PIDRA_PIN12                               (0x1000U)
#define GPIO_PIDRA_PIN13_POS                           (13U)
#define GPIO_PIDRA_PIN13                               (0x2000U)
#define GPIO_PIDRA_PIN14_POS                           (14U)
#define GPIO_PIDRA_PIN14                               (0x4000U)
#define GPIO_PIDRA_PIN15_POS                           (15U)
#define GPIO_PIDRA_PIN15                               (0x8000U)

/*  Bit definition for GPIO_PODRA register  */
#define GPIO_PODRA_POUT00_POS                          (0U)
#define GPIO_PODRA_POUT00                              (0x0001U)
#define GPIO_PODRA_POUT04_POS                          (4U)
#define GPIO_PODRA_POUT04                              (0x0010U)
#define GPIO_PODRA_POUT08_POS                          (8U)
#define GPIO_PODRA_POUT08                              (0x0100U)
#define GPIO_PODRA_POUT11_POS                          (11U)
#define GPIO_PODRA_POUT11                              (0x0800U)
#define GPIO_PODRA_POUT12_POS                          (12U)
#define GPIO_PODRA_POUT12                              (0x1000U)
#define GPIO_PODRA_POUT13_POS                          (13U)
#define GPIO_PODRA_POUT13                              (0x2000U)
#define GPIO_PODRA_POUT14_POS                          (14U)
#define GPIO_PODRA_POUT14                              (0x4000U)
#define GPIO_PODRA_POUT15_POS                          (15U)
#define GPIO_PODRA_POUT15                              (0x8000U)

/*  Bit definition for GPIO_POERA register  */
#define GPIO_POERA_POUTE00_POS                         (0U)
#define GPIO_POERA_POUTE00                             (0x0001U)
#define GPIO_POERA_POUTE04_POS                         (4U)
#define GPIO_POERA_POUTE04                             (0x0010U)
#define GPIO_POERA_POUTE08_POS                         (8U)
#define GPIO_POERA_POUTE08                             (0x0100U)
#define GPIO_POERA_POUTE11_POS                         (11U)
#define GPIO_POERA_POUTE11                             (0x0800U)
#define GPIO_POERA_POUTE12_POS                         (12U)
#define GPIO_POERA_POUTE12                             (0x1000U)
#define GPIO_POERA_POUTE13_POS                         (13U)
#define GPIO_POERA_POUTE13                             (0x2000U)
#define GPIO_POERA_POUTE14_POS                         (14U)
#define GPIO_POERA_POUTE14                             (0x4000U)
#define GPIO_POERA_POUTE15_POS                         (15U)
#define GPIO_POERA_POUTE15                             (0x8000U)

/*  Bit definition for GPIO_POSRA register  */
#define GPIO_POSRA_POS00_POS                           (0U)
#define GPIO_POSRA_POS00                               (0x0001U)
#define GPIO_POSRA_POS04_POS                           (4U)
#define GPIO_POSRA_POS04                               (0x0010U)
#define GPIO_POSRA_POS08_POS                           (8U)
#define GPIO_POSRA_POS08                               (0x0100U)
#define GPIO_POSRA_POS11_POS                           (11U)
#define GPIO_POSRA_POS11                               (0x0800U)
#define GPIO_POSRA_POS12_POS                           (12U)
#define GPIO_POSRA_POS12                               (0x1000U)
#define GPIO_POSRA_POS13_POS                           (13U)
#define GPIO_POSRA_POS13                               (0x2000U)
#define GPIO_POSRA_POS14_POS                           (14U)
#define GPIO_POSRA_POS14                               (0x4000U)
#define GPIO_POSRA_POS15_POS                           (15U)
#define GPIO_POSRA_POS15                               (0x8000U)

/*  Bit definition for GPIO_PORRA register  */
#define GPIO_PORRA_POR00_POS                           (0U)
#define GPIO_PORRA_POR00                               (0x0001U)
#define GPIO_PORRA_POR04_POS                           (4U)
#define GPIO_PORRA_POR04                               (0x0010U)
#define GPIO_PORRA_POR08_POS                           (8U)
#define GPIO_PORRA_POR08                               (0x0100U)
#define GPIO_PORRA_POR11_POS                           (11U)
#define GPIO_PORRA_POR11                               (0x0800U)
#define GPIO_PORRA_POR12_POS                           (12U)
#define GPIO_PORRA_POR12                               (0x1000U)
#define GPIO_PORRA_POR13_POS                           (13U)
#define GPIO_PORRA_POR13                               (0x2000U)
#define GPIO_PORRA_POR14_POS                           (14U)
#define GPIO_PORRA_POR14                               (0x4000U)
#define GPIO_PORRA_POR15_POS                           (15U)
#define GPIO_PORRA_POR15                               (0x8000U)

