MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F452FEUB/mcu.h
/*  Bit definition for GPIO_POSRC register  */
#define GPIO_POSRC_POS13_POS                           (13U)
#define GPIO_POSRC_POS13                               (0x2000U)
#define GPIO_POSRC_POS14_POS                           (14U)
#define GPIO_POSRC_POS14                               (0x4000U)
#define GPIO_POSRC_POS15_POS                           (15U)
#define GPIO_POSRC_POS15                               (0x8000U)

/*  Bit definition for GPIO_PORRC register  */
#define GPIO_PORRC_POR13_POS                           (13U)
#define GPIO_PORRC_POR13                               (0x2000U)
#define GPIO_PORRC_POR14_POS                           (14U)
#define GPIO_PORRC_POR14                               (0x4000U)
#define GPIO_PORRC_POR15_POS                           (15U)
#define GPIO_PORRC_POR15                               (0x8000U)

/*  Bit definition for GPIO_POTRC register  */
#define GPIO_POTRC_POT13_POS                           (13U)
#define GPIO_POTRC_POT13                               (0x2000U)
#define GPIO_POTRC_POT14_POS                           (14U)
#define GPIO_POTRC_POT14                               (0x4000U)
#define GPIO_POTRC_POT15_POS                           (15U)
#define GPIO_POTRC_POT15                               (0x8000U)

/*  Bit definition for GPIO_PIDRH register  */
#define GPIO_PIDRH_PIN00_POS                           (0U)
#define GPIO_PIDRH_PIN00                               (0x0001U)
#define GPIO_PIDRH_PIN01_POS                           (1U)
#define GPIO_PIDRH_PIN01                               (0x0002U)
#define GPIO_PIDRH_PIN02_POS                           (2U)
#define GPIO_PIDRH_PIN02                               (0x0004U)

/*  Bit definition for GPIO_PODRH register  */
#define GPIO_PODRH_POUT00_POS                          (0U)
#define GPIO_PODRH_POUT00                              (0x0001U)
#define GPIO_PODRH_POUT01_POS                          (1U)
#define GPIO_PODRH_POUT01                              (0x0002U)
#define GPIO_PODRH_POUT02_POS                          (2U)
#define GPIO_PODRH_POUT02                              (0x0004U)

/*  Bit definition for GPIO_POERH register  */
#define GPIO_POERH_POUTE00_POS                         (0U)
#define GPIO_POERH_POUTE00                             (0x0001U)
#define GPIO_POERH_POUTE01_POS                         (1U)
#define GPIO_POERH_POUTE01                             (0x0002U)
#define GPIO_POERH_POUTE02_POS                         (2U)
#define GPIO_POERH_POUTE02                             (0x0004U)

/*  Bit definition for GPIO_POSRH register  */
#define GPIO_POSRH_POS00_POS                           (0U)
#define GPIO_POSRH_POS00                               (0x0001U)
#define GPIO_POSRH_POS01_POS                           (1U)
#define GPIO_POSRH_POS01                               (0x0002U)
#define GPIO_POSRH_POS02_POS                           (2U)
#define GPIO_POSRH_POS02                               (0x0004U)

/*  Bit definition for GPIO_PORRH register  */
#define GPIO_PORRH_POR00_POS                           (0U)
#define GPIO_PORRH_POR00                               (0x0001U)
#define GPIO_PORRH_POR01_POS                           (1U)
#define GPIO_PORRH_POR01                               (0x0002U)
#define GPIO_PORRH_POR02_POS                           (2U)
#define GPIO_PORRH_POR02                               (0x0004U)

/*  Bit definition for GPIO_POTRH register  */
#define GPIO_POTRH_POT00_POS                           (0U)
#define GPIO_POTRH_POT00                               (0x0001U)
#define GPIO_POTRH_POT01_POS                           (1U)
#define GPIO_POTRH_POT01                               (0x0002U)
#define GPIO_POTRH_POT02_POS                           (2U)
#define GPIO_POTRH_POT02                               (0x0004U)

/*  Bit definition for GPIO_PSPCR register  */
#define GPIO_PSPCR_SPFE                                (0x001FU)
#define GPIO_PSPCR_SPFE_0                              (0x0001U)
#define GPIO_PSPCR_SPFE_1                              (0x0002U)
#define GPIO_PSPCR_SPFE_2                              (0x0004U)
#define GPIO_PSPCR_SPFE_3                              (0x0008U)
#define GPIO_PSPCR_SPFE_4                              (0x0010U)

/*  Bit definition for GPIO_PCCR register  */
#define GPIO_PCCR_BFSEL_POS                            (0U)
#define GPIO_PCCR_BFSEL                                (0x000FU)
#define GPIO_PCCR_BFSEL_0                              (0x0001U)
#define GPIO_PCCR_BFSEL_1                              (0x0002U)
#define GPIO_PCCR_BFSEL_2                              (0x0004U)
#define GPIO_PCCR_BFSEL_3                              (0x0008U)
#define GPIO_PCCR_RDWT_POS                             (14U)
#define GPIO_PCCR_RDWT                                 (0xC000U)
#define GPIO_PCCR_RDWT_0                               (0x4000U)
#define GPIO_PCCR_RDWT_1                               (0x8000U)

/*  Bit definition for GPIO_PINAER register  */
#define GPIO_PINAER_PINAE                              (0x003FU)
#define GPIO_PINAER_PINAE_0                            (0x0001U)
#define GPIO_PINAER_PINAE_1                            (0x0002U)
#define GPIO_PINAER_PINAE_2                            (0x0004U)
#define GPIO_PINAER_PINAE_3                            (0x0008U)
#define GPIO_PINAER_PINAE_4                            (0x0010U)
#define GPIO_PINAER_PINAE_5                            (0x0020U)

/*  Bit definition for GPIO_PWPR register  */
#define GPIO_PWPR_WE_POS                               (0U)
#define GPIO_PWPR_WE                                   (0x0001U)
#define GPIO_PWPR_WP_POS                               (8U)
#define GPIO_PWPR_WP                                   (0xFF00U)
#define GPIO_PWPR_WP_0                                 (0x0100U)
#define GPIO_PWPR_WP_1                                 (0x0200U)
#define GPIO_PWPR_WP_2                                 (0x0400U)
#define GPIO_PWPR_WP_3                                 (0x0800U)
#define GPIO_PWPR_WP_4                                 (0x1000U)
#define GPIO_PWPR_WP_5                                 (0x2000U)
#define GPIO_PWPR_WP_6                                 (0x4000U)
#define GPIO_PWPR_WP_7                                 (0x8000U)

/*  Bit definition for GPIO_PCR register  */
#define GPIO_PCR_POUT_POS                              (0U)
#define GPIO_PCR_POUT                                  (0x0001U)
#define GPIO_PCR_POUTE_POS                             (1U)
#define GPIO_PCR_POUTE                                 (0x0002U)
#define GPIO_PCR_NOD_POS                               (2U)
#define GPIO_PCR_NOD                                   (0x0004U)
#define GPIO_PCR_DRV_POS                               (4U)
#define GPIO_PCR_DRV                                   (0x0030U)
#define GPIO_PCR_DRV_0                                 (0x0010U)
#define GPIO_PCR_DRV_1                                 (0x0020U)
#define GPIO_PCR_PUU_POS                               (6U)
#define GPIO_PCR_PUU                                   (0x0040U)
#define GPIO_PCR_PIN_POS                               (8U)
#define GPIO_PCR_PIN                                   (0x0100U)
#define GPIO_PCR_INVE_POS                              (9U)
#define GPIO_PCR_INVE                                  (0x0200U)
#define GPIO_PCR_INTE_POS                              (12U)
#define GPIO_PCR_INTE                                  (0x1000U)
#define GPIO_PCR_LTE_POS                               (14U)
#define GPIO_PCR_LTE                                   (0x4000U)
#define GPIO_PCR_DDIS_POS                              (15U)
#define GPIO_PCR_DDIS                                  (0x8000U)

/*  Bit definition for GPIO_PFSR register  */
#define GPIO_PFSR_FSEL_POS                             (0U)
#define GPIO_PFSR_FSEL                                 (0x003FU)
#define GPIO_PFSR_FSEL_0                               (0x0001U)
#define GPIO_PFSR_FSEL_1                               (0x0002U)
#define GPIO_PFSR_FSEL_2                               (0x0004U)
#define GPIO_PFSR_FSEL_3                               (0x0008U)
#define GPIO_PFSR_FSEL_4                               (0x0010U)
#define GPIO_PFSR_FSEL_5                               (0x0020U)
#define GPIO_PFSR_BFE_POS                              (8U)
#define GPIO_PFSR_BFE                                  (0x0100U)

